In [37]:
import sqlalchemy as db
import pandas as pd

In [16]:
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

In [174]:
with engine.connect() as con:
    print(pd.read_sql('SELECT f.name AS Facility, STRFTIME("%m", b.starttime) AS Month, \
        SUM(b.slots) AS "Member Usage" \
        FROM Bookings as b \
        LEFT JOIN Facilities as f \
        USING(facid) \
        WHERE memid <>0 \
        GROUP BY f.name, Month \
        ORDER BY Facility, Month', con))

           Facility Month  Member Usage
0   Badminton Court    07           165
1   Badminton Court    08           414
2   Badminton Court    09           507
3    Massage Room 1    07           166
4    Massage Room 1    08           316
5    Massage Room 1    09           402
6    Massage Room 2    07             8
7    Massage Room 2    08            18
8    Massage Room 2    09            28
9        Pool Table    07           110
10       Pool Table    08           303
11       Pool Table    09           443
12    Snooker Table    07           140
13    Snooker Table    08           316
14    Snooker Table    09           404
15     Squash Court    07            50
16     Squash Court    08           184
17     Squash Court    09           184
18     Table Tennis    07            98
19     Table Tennis    08           296
20     Table Tennis    09           400
21   Tennis Court 1    07           201
22   Tennis Court 1    08           339
23   Tennis Court 1    09           417
24   Tennis Court 2    07           123
25   Tennis Court 2    08           345
26   Tennis Court 2    09           414

In [98]:
with engine.connect() as con:
    print(pd.read_sql('SELECT rev.Name, rev.Revenue \
    FROM (SELECT f.name as Name, SUM(CASE WHEN b.memid = 0 THEN b.slots * f.guestcost \
    ELSE b.slots * f.membercost END) AS Revenue FROM Bookings AS b INNER JOIN Facilities AS f USING(facid) \
    GROUP BY f.name ORDER BY Revenue) AS rev \
    WHERE Revenue < 1000', con))

            Name  Revenue
0   Table Tennis      180
1  Snooker Table      240
2     Pool Table      270

In [111]:
with engine.connect() as con:
    print(pd.read_sql('SELECT * \
        FROM Members as m1 \
        LIMIT 10', con))

   memid   surname firstname                             address  zipcode  \
0      0     GUEST     GUEST                               GUEST        0
1      1     Smith    Darren          8 Bloomsbury Close, Boston     4321
2      2     Smith     Tracy        8 Bloomsbury Close, New York     4321
3      3    Rownam       Tim              23 Highway Way, Boston    23423
4      4  Joplette    Janice          20 Crossing Road, New York      234
5      5   Butters    Gerald      1065 Huntingdon Avenue, Boston    56754
6      6     Tracy    Burton             3 Tunisia Drive, Boston    45678
7      7      Dare     Nancy         6 Hunting Lodge Way, Boston    10383
8      8    Boothe       Tim  3 Bloomsbury Close, Reading, 00234      234
9      9  Stibbons    Ponder           5 Dragons Way, Winchester    87630

        telephone recommendedby             joindate
0  (000) 000-0000                2012-07-01 00:00:00
1    555-555-5555                2012-07-02 12:02:05
2    555-555-5555                2012-07-02 12:08:23
3  (844) 693-0723                2012-07-03 09:32:15
4  (833) 942-4710             1  2012-07-03 10:25:05
5  (844) 078-4130             1  2012-07-09 10:44:09
6  (822) 354-9973                2012-07-15 08:52:55
7  (833) 776-4001             4  2012-07-25 08:59:12
8  (811) 433-2547             3  2012-07-25 16:02:35
9  (833) 160-3900             6  2012-07-25 17:09:05

In [119]:
with engine.connect() as con:
    print(pd.read_sql('SELECT m1.surname, m1.firstname, m1.recommendedby, \
        m2.surname, m2.firstname\
        FROM Members as m1 \
        LEFT JOIN Members as m2 \
        ON m1.recommendedby = m2.memid \
        ORDER BY m1.surname, m1.firstname', con))

              surname  firstname recommendedby   surname  firstname
0               Bader   Florence             9  Stibbons     Ponder
1               Baker       Anne             9  Stibbons     Ponder
2               Baker    Timothy            13   Farrell     Jemima
3              Boothe        Tim             3    Rownam        Tim
4             Butters     Gerald             1     Smith     Darren
5              Coplin       Joan            16     Baker    Timothy
6             Crumpet      Erica             2     Smith      Tracy
7                Dare      Nancy             4  Joplette     Janice
8             Farrell      David                    None       None
9             Farrell     Jemima                    None       None
10              GUEST      GUEST                    None       None
11            Genting    Matthew             5   Butters     Gerald
12               Hunt       John            30   Purview  Millicent
13              Jones      David             4  Joplette     Janice
14              Jones    Douglas            11     Jones      David
15           Joplette     Janice             1     Smith     Darren
16          Mackenzie       Anna             1     Smith     Darren
17               Owen    Charles             1     Smith     Darren
18             Pinker      David            13   Farrell     Jemima
19            Purview  Millicent             2     Smith      Tracy
20             Rownam        Tim                    None       None
21             Rumney  Henrietta            20   Genting    Matthew
22             Sarwin  Ramnaresh            15     Bader   Florence
23              Smith     Darren                    None       None
24              Smith     Darren                    None       None
25              Smith       Jack             1     Smith     Darren
26              Smith      Tracy                    None       None
27           Stibbons     Ponder             6     Tracy     Burton
28              Tracy     Burton                    None       None
29         Tupperware   Hyacinth                    None       None
30  Worthington-Smyth      Henry             2     Smith      Tracy

In [149]:
with engine.connect() as con:
    print(pd.read_sql('SELECT f.name, SUM(b.slots) as Total \
        FROM Bookings as b \
        LEFT JOIN Facilities as f USING(facid) \
        LEFT JOIN Members as m USING(memid) \
        WHERE memid <> 0 \
        GROUP BY name \
        ORDER BY name \
        LIMIT 25', con))

              name  Total
0  Badminton Court   1086
1   Massage Room 1    884
2   Massage Room 2     54
3       Pool Table    856
4    Snooker Table    860
5     Squash Court    418
6     Table Tennis    794
7   Tennis Court 1    957
8   Tennis Court 2    882

In [158]:
with engine.connect() as con:
    print(pd.read_sql('SELECT f.name AS Facility, STRFTIME("%m", b.starttime) AS Month, SUM(b.slots) AS "Member Usage" \
        FROM Bookings as b \
        LEFT JOIN Facilities as f \
        USING(facid) \
        WHERE memid <>0 \
        GROUP BY f.name, Month \
        ORDER BY Facility, Month', con))

           Facility Month  Member Usage
0   Badminton Court    07           165
1   Badminton Court    08           414
2   Badminton Court    09           507
3    Massage Room 1    07           166
4    Massage Room 1    08           316
5    Massage Room 1    09           402
6    Massage Room 2    07             8
7    Massage Room 2    08            18
8    Massage Room 2    09            28
9        Pool Table    07           110
10       Pool Table    08           303
11       Pool Table    09           443
12    Snooker Table    07           140
13    Snooker Table    08           316
14    Snooker Table    09           404
15     Squash Court    07            50
16     Squash Court    08           184
17     Squash Court    09           184
18     Table Tennis    07            98
19     Table Tennis    08           296
20     Table Tennis    09           400
21   Tennis Court 1    07           201
22   Tennis Court 1    08           339
23   Tennis Court 1    09           417
24   Tennis Court 2    07           123
25   Tennis Court 2    08           345
26   Tennis Court 2    09           414